#include <stdio.h>

// * 비교연산 *
// 앞으로 배울 판단문에서 사용할 내용입니다.
// 특히 주의할 것은, 같은가?(==)가 등호(=)가 2개임을 주의합니다.
//    등호(=)가 한개이면, 대입연산이 되므로, 이와 구분하기 위해서 2개를 쓰는 것입니다.
// 두번 째, 주의 할 것은, "같지 않다."에서 느낌표(!)를 사용한다는 것입니다.
//    느낌표(!)는 아니다(NOT)을 의미합니다.
//    맞다(true)는 아니다(NOT)가 아닌것을 의미합니다.
//    아니다(NOT)는 숫자로(0,NULL:없다)를 의미합니다.
//    따라서, "맞다"는 0이 아닌 모든 숫자가 됩니다.
//    참고로, "맞다"의 대표는 1입니다.

void main()
{
	int i = 10;
	int j = 15;

	printf("i >  j = %d\n", i > j);
	printf("i <= j = %d\n", i <= j);
	printf("i == j = %d\n", i != j);
	printf("i != j = %d\n", i != j);
	printf("!i     = %d\n", !i);
	printf("!0     = %d\n", !0);
}